# ApplicationId Property (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
DirectShape..::..ApplicationId Property
DirectShape Class See Also
---
A text string that identifies the creating application.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2017
# Syntax
C#
---
```text
public string ApplicationId { get; set; }
```

Visual Basic
---
```text
Public Property ApplicationId As String
	Get
	Set
```

Visual C++
---
```text
public:
property String^ ApplicationId {
	String^ get ();
	void set (String^ value);
}
```

# Remarks
The creating application may use any text string as appropriate for its purposes, or leave this property unset. One option is to use Application.ActiveAddInId for a unique application id, or concatenate it with an application name for a more informative, but still unique id.
# Exceptions
| Exception | Condition |
| --- | --- |
| --- | --- |
| Autodesk.Revit.Exceptions..::..ArgumentNullException | When setting this property: A non-optional argument was null |

# See Also
DirectShape Class
Autodesk.Revit.DB Namespace